In [1]:
!pip install numpy pandas

Requirement already satisfied: numpy in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.24.2)
Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from pandas) (2022.7.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

float_data = pd.Series([1.2, -3.5, np.nan, 0, 6, 12])
float_data

0     1.2
1    -3.5
2     NaN
3     0.0
4     6.0
5    12.0
dtype: float64

In [4]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [5]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [6]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = pd.Series([1, 2, None], dtype="float64")

In [8]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                    [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = np.nan

In [17]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [20]:
df.iloc[:4, 1] = np.nan

In [21]:
df.iloc[:2, 2] = np.nan

In [22]:
df

          0         1         2
0 -0.115655       NaN       NaN
1  1.450855       NaN       NaN
2 -0.223932       NaN -0.379230
3  0.468304       NaN -0.795653
4 -0.738383 -1.460360 -0.192784
5 -0.464979 -0.085694  0.340032
6 -1.536092 -0.577499  1.727335

In [23]:
df.fillna(0)

          0         1         2
0 -0.115655  0.000000  0.000000
1  1.450855  0.000000  0.000000
2 -0.223932  0.000000 -0.379230
3  0.468304  0.000000 -0.795653
4 -0.738383 -1.460360 -0.192784
5 -0.464979 -0.085694  0.340032
6 -1.536092 -0.577499  1.727335

In [24]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.115655  0.500000  0.000000
1  1.450855  0.500000  0.000000
2 -0.223932  0.500000 -0.379230
3  0.468304  0.500000 -0.795653
4 -0.738383 -1.460360 -0.192784
5 -0.464979 -0.085694  0.340032
6 -1.536092 -0.577499  1.727335

In [25]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [26]:
df.iloc[2:, 1] = np.nan

In [27]:
df.iloc[4:, 2] = np.nan

In [28]:
df

          0         1         2
0  0.895115 -0.362554  0.552784
1  0.145266 -0.108079  0.773621
2  1.735259       NaN  0.422889
3  0.848572       NaN -0.403823
4 -0.723662       NaN       NaN
5  0.783714       NaN       NaN

In [29]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [30]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"], "k2": [1, 1, 2, 3, 3, 4, 4]})

In [33]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool